Tekla.Structures.Dialog.UIControls.ComponentCatalog.componentSelectionForm
New instance of the component selection dialog

Tekla.Structures.Dialog.UIControls.ComponentCatalog.OnSelectClickedOld(System.Object,System.EventArgs)
Opens the component catalog dialog for selecting a component (original code)
sender: The sender.
eventArgs: The event args.

Tekla.Structures.Dialog.UIControls.ComponentCatalog.OnSelectClickedNew(System.Object,System.EventArgs)
Opens the component catalog dialog for selecting a component (new component catalog code)
sender: The sender.
eventArgs: The event args.

Tekla.Structures.Dialog.UIControls.ComponentCatalog.ComponentSelectionForm
Gets or sets new instance of the component selection dialog